Repository: marcosjunqueira/sonar-l10n-pt-omegat
Catalog: tm/core-omegat.tmx
Source language: en_us
Languages: pt_br

source: If another session of the program is running with the same user directory, please click Cancel to prevent the corruption of the user directory.
pt_br: Se outra sessão do programa estiver executando no mesmo diretório de usuário, por favor, clique em cancelar para prevenir a corrupção do seu diretório de usuário.

source: If you are sure that no other instances of the program are running with your user directory, click OK to continue.
pt_br: Se tiver certeza que nenhuma outra instância está rodando no seu diretório de usuário, clique em "OK" para continuar.

source: {0} is not a valid NetBeans module.
pt_br: {0} não é um módulo válido do NetBeans.

source: The core bootstrap of NetBeans-based applications.
pt_br: O núcleo de bootstrap das aplicações baseadas no NetBeans.

source: This module provides the initial infrastructure that loads all other parts of the application.
pt_br: Este módulo fornece a infra-estrutura inicial que carrega todas as outras partes da aplicação.

source: Cannot run on older versions of Java than Java 5 Standard Edition.
pt_br: Não é possível executar em versões anteriores ao Java 5 Standard Edition.

source: Please install Java 5 Standard Edition or newer or use --jdkhome switch to point to its installation directory.
pt_br: Por favor, instale o Java 5 Standard Edition ou superior ou utilize --jdkhome para modificar o diretório de instalação do JDK.

source: Java 5 Standard Edition or newer required
pt_br: O Java 5 Standard Edition ou superior é obrigatório.

source: &Add to Favorites
pt_br: &Adicionar aos favoritos

source: &Add to Favorites...
pt_br: &Adicionar aos favoritos...

source: &Remove from Favorites
pt_br: &Remover dos favoritos

source: Favor&ites
pt_br: Favor&itos

source: Favorites
pt_br: Favoritos

source: Select in Favorites
pt_br: Selecionar nos favoritos

source: User Configuration Properties
pt_br: Propriedades de configurações do usuário

source: Folder
pt_br: Pasta

source: Empty File
pt_br: Arquivo vazio

source: Add to Favorites
pt_br: Adicionar aos favoritos

source: Add
pt_br: Adicionar

source: {0} does not exist.
pt_br: {0} não existe.

source: The document node could not be found in the Favorites tab.
pt_br: O nó do documento não pode ser encontrado na aba favoritos.

source: Support for organizing favorite files.
pt_br: Suporte para organizar arquivos favoritos.

source: Favorites module enables you to create a view of files specifically relevant to your work, simply access them at one common place.
pt_br: O módulo favoritos permite a você criar uma visão dos arquivos especificamente relevantes para seu trabalho, simplesmente acessando-os a partir de um único lugar.

source: Creates an empty file with an arbitrary extension on your disk.
pt_br: Criar um arquivo vazio com uma extensão arbitrária no seu disco.

source: Creates a new folder on your disk.
pt_br: Criar uma nova pasta em seu disco.

source: &Open in Editor
pt_br: Abrir no edit&or

source: &Templates
pt_br: &Modelos

source: Customize templates
pt_br: Personalizar modelos

source: Template Manager
pt_br: Gerenciador de modelos

source: &Templates:
pt_br: &Modelos:

source: &Add...
pt_br: &Adicionar...

source: &Rename
pt_br: &Renomear

source: Du&plicate
pt_br: &Duplicar

source: &New Folder
pt_br: &Nova pasta

source: Add Template
pt_br: Adicionar modelo

source: New Template
pt_br: Novo modelo

source: Duplicate Selected Template
pt_br: Duplicar modelo selecionado

source: Rename Template
pt_br: Renomear modelo

source: Move Up Selected Template
pt_br: Mover o modelo selecionado para cima

source: Move Down Selected Template
pt_br: Mover o modelo selecionado para baixo

source: Delete Template
pt_br: Excluir modelo

source: Navigator
pt_br: Navegador

source: {0} - Navigator
pt_br: {0} - Navegador

source: &Navigator
pt_br: &Navegador

source: Navigator window shows structure and outline view for active document in the system.
pt_br: A janela do navegador mostra a estrutura e os tópicos para o documento ativo no sistema.

source: <No View Available>
pt_br: <Nenhuma visualização disponível>

source: &Navigating
pt_br: &Navegar

source: Navigator API
pt_br: API do navegador

source: Navigation support SPIs and APIs
pt_br: SPIs e APIs de suporte ao navegador

source: Provides basic SPIs and APIs for implementing navigation support like structure and outline views for active document in the system.
pt_br: Fornece SPIs e APIs básicas para implementar suporte de navegação, como visões de estruturas e tópicos para o documento ativo no sistema.

source: Settings API
pt_br: API de configurações

source: A library for storing settings in custom formats.
pt_br: Uma biblioteca para armazenar as configurações em formato personalizado.

source: This module provides the Settings API for storing module-defined settings in custom formats.
pt_br: Este módulo fornece a API de configurações para armazenar configurações definidas por módulos em formato personalizado.

source: It also provides several useful settings format implementations.
pt_br: Também fornece várias configurações úteis para formatos de configurações.

source: <Only Workspace>
pt_br: <Somente área de trabalho>

source: Core - Windows
pt_br: Núcleo - Janelas

source: Implementation for windowing support.
pt_br: Implementação do suporte a janelas.

source: Adds classes implementing the window system part of the APIs.
pt_br: Adiciona classes que implementam a parte da API responsável pelo sistema de janelas.

source: C&lone Document
pt_br: C&lonar documento

source: &Close Window
pt_br: Fe&char janela

source: Go to P&revious Document
pt_br: Ir para documento ante&rior

source: Close &All Documents
pt_br: Fech&ar todos os documentos

source: Undock Window
pt_br: Desacoplar janela

source: Dock Window
pt_br: Acoplar janela

source: Close All Documents
pt_br: Fechar todos os documentos

source: Close Other Documents
pt_br: Fechar os outros documentos

source: Save Document
pt_br: Salvar documento

source: Clone Document
pt_br: Clonar documento

source: Clos&e Other Documents
pt_br: F&echar os outros documentos

source: &Maximize Window
pt_br: &Maximizar janela

source: Re&store Window
pt_br: &Restaurar janela

source: Attach "{0}" to
pt_br: Anexar "{0}" a

source: Documents
pt_br: Documentos

source: As a Last Tab
pt_br: Igual à última aba

source: Top
pt_br: Superior

source: Left
pt_br: Esquerda

source: Bottom
pt_br: Inferior

source: Right
pt_br: Direita

source: &Documents...
pt_br: &Documentos...

source: &Toolbars
pt_br: Barra de ferramen&tas

source: Next Tab
pt_br: Próxima aba

source: Previous Tab
pt_br: Aba anterior

source: &Full Screen
pt_br: Tela c&heia

source: Reset &Windows
pt_br: Redefinir jane&las

source: Main Window
pt_br: Janela principal

source: NetBeans Platform {0}
pt_br: Plataforma NetBeans {0}

source: &Documents:
pt_br: &Documentos:

source: Descri&ption:
pt_br: D&escrição:

source: Swi&tch to Document
pt_br: Alternar para documento

source: C&lose Document(s)
pt_br: Fe&char documento(s)

source: &Save Documents(s)
pt_br: &Salvar documento(s)

source: &Small Toolbar Icons
pt_br: Ícones pequeno&s na barra de ferramentas

source: cannot add to layout: does not use ToolbarConstraints
pt_br: Não é possível adicionar ao layout: não utiliza ToolbarConstraints

source: &Customize...
pt_br: &Personalizar...

source: &New Toolbar...
pt_br: &Nova barra de ferramentas...

source: Drag items to or from the toolbars to add or remove them...
pt_br: Arraste os itens para a barra de ferramentas ou arraste a partir dela para adicioná-los ou removê-los...

source: Please wait...
pt_br: Aguarde...

source: Customize Toolbars
pt_br: Personalizar barra de ferramentas

source: Drag items from here to toolbars.
pt_br: Arraste os itens daqui para as barras de ferramentas.

source: Actions Pool
pt_br: Pool de ações

source: Actions Pool Scrollbar
pt_br: Barra de rolagens do pool de ações

source: Toolbar Customizer
pt_br: Personalizador da barra de ferramentas

source: Close Button
pt_br: Botão fechar

source: New Toolbar Button
pt_br: Novo botão da barra de ferramentas

source: Small Icons Checkbox
pt_br: Caixa de seleção de ícones pequenos

source: &Reset Toolbars
pt_br: &Redefinir barra de ferramentas

source: Cannot parse configuration of window manager {0}.
pt_br: Não foi possível processar a configuração do gerenciador de janelas {0}.

source: Cannot parse configuration of Group {0}.
pt_br: Não foi possível processar a configuração do grupo {0}.

source: Cannot parse configuration of TCGroup {0}.
pt_br: Não foi possível processar a configuração do TCGroup {0}.

source: Cannot parse configuration of TCRef {0}.
pt_br: Não foi possível processar a configuração do TCRef {0}.

source: Cannot parse configuration of mode {0}.
pt_br: Não foi possível processar a configuração do modo {0}.

source: Cannot create root folder {0}
pt_br: Não foi possível criar a pasta raiz {0}

source: Cannot create components folder {0}
pt_br: Não foi possível criar a pasta de componentes {0}

source: Cannot create groups folder {0}
pt_br: Não foi possível criar a pasta de grupos {0}

source: Cannot create modes folder {0}
pt_br: Não foi possível criar a pasta de modos {0}

source: Top component {0} could not be loaded, either owning module was disabled, has incompatible version or top component's settings file format is broken.
pt_br: O componente superior {0} não pôde ser carregado: seu módulo está desativado, tem versão incompatível ou o formato do arquivo de configurações do componente está corrompido.

source: Top component {0} could not be located or loaded from 'Components' folder.
pt_br: O componente superior {0} não pôde ser localizado ou carregado a partir da pasta 'Componentes'.

source: Settings of top component {0} could not be saved
pt_br: As configurações do componente superior {0} não puderam ser salvas

source: Cannot copy component settings file to folder {0}.
pt_br: Não foi possível copiar o arquivo de configurações do componente para a pasta {0}.

source: Component {0} could not be saved due to problems with its serialization.
pt_br: O componente {0} não pôde ser salvo devido a problemas em sua serialização.

source: Component {0} could not be opened due to problems with its deserialization.
pt_br: O componente {0} não pôde ser carregado devido a problemas em sua desserialização.

source: Cancel
pt_br: Cancelar

source: Yes
pt_br: Sim

source: No
pt_br: Não

source: Details
pt_br: Detalhes

source: Button
pt_br: Botão

source: File selector dialog
pt_br: Caixa de diálogo de seleção de arquivos

source: Tree view in file selector
pt_br: Visualização em árvore no seletor de arquivos

source: Select a filesystem.
pt_br: Selecione um sistema de arquivos.

source: Provides access to the menu configuration.
pt_br: Fornece acesso ao menu de configurações.

source: Separator
pt_br: Separador

source: New Menu
pt_br: Novo menu

source: Name
pt_br: Nome

source: Name of the menu folder.
pt_br: Nome da pasta do menu.

source: Customizer Dialog
pt_br: Caixa de diálogo Personalizador

source: Yes button
pt_br: Botão sim

source: Error: {0}
pt_br: Erro: {0}

source: Warning: {0}
pt_br: Aviso: {0}

source: Question {0}
pt_br: Pergunta {0}

source: Information {0}
pt_br: Informação {0}

source: Cancel button
pt_br: Botão cancelar

source: OK button
pt_br: Botão ok

source: No button
pt_br: Botão não

source: Help button
pt_br: Botão ajuda

source: Close button
pt_br: Botão fechar

source: Provides access to the toolbar configuration.
pt_br: Fornece acesso às configurações da barra de ferramentas.

source: Toolbar
pt_br: Barra de ferramentas

source: New Toolbar
pt_br: Nova barra de ferramentas

source: Name of the toolbar folder.
pt_br: Nome da pasta da barra de ferramentas.

source: Visible
pt_br: Visível

source: Whether the toolbar is visible in current toolbar configuration.
pt_br: Indica se a barra de ferramentas está visível em sua configuração atual.

source: Toolbar {0} already exists.
pt_br: A barra de ferramentas {0} já existe.

source: Output Window
pt_br: Janela de saída

source: A simple text area based output window implementation
pt_br: Um implementação simples de janela de saída baseada em uma área de texto

source: Output window based on a java.swing.text.Document over a ByteBuffer/CharBuffer
pt_br: Janela de saída baseada em java.swing.text.Document sobre um ByteBuffer/CharBuffer

source: Output
pt_br: Saída

source: Cannot write to system temp directory ({0})
pt_br: Não foi possível escrever no diretório temporário de sistema ({0})

source: Problem writing to output file
pt_br: Problema gravando o arquivo de saída

source: Standard output
pt_br: Saída padrão

source: {0} exists.
pt_br: {0} existe.

source: Overwrite?
pt_br: Sobrescrever?

source: Save Output As
pt_br: Salvar saída como

source: &Output
pt_br: &Saída

source: Find
pt_br: Localizar

source: &Find What:
pt_br: &Localizar o quê:

source: Fin&d
pt_br: Locali&zar

source: Overwrite file?
pt_br: Sobrescrever arquivo?

source: Wrap text
pt_br: Quebra de linha

source: Save As...
pt_br: Salvar como...

source: Clear
pt_br: Limpar

source: Previous Error
pt_br: Erro anterior

source: Next Error
pt_br: Próximo erro

source: Select all
pt_br: Selecionar todos

source: Find...
pt_br: Localizar...

source: Find Next
pt_br: Localizar próximo

source: Find Previous
pt_br: Localizar anterior

source: Ran out of disk space in {0} for temporary output files.
pt_br: Não há mais espaço no disco {0} para arquivos de saída temporários.

source: Either make more disk space available, change the system temporary directory or run with -J-Dnb.output.heap=true
pt_br: Libere mais espaço no disco, altere o diretório temporário do sistema ou execute com -J-Dnb.output.heap=true

source: &Input
pt_br: &Entrada

source: &Close Input
pt_br: &Fechar entrada

source: Closes the input component and sends end-of-file to any readers
pt_br: Fecha o componente de entrada e envia marcador de fim de arquivo (EOF) para quaisquer leitores

source: Enter text and press enter to send it to the running process
pt_br: Entre com o texto e pressione enter para enviá-lo para o processo em execução

source: Startup
pt_br: Inicialização

source: Loads and enables modules.
pt_br: Carrega e habilita módulos.

source: This module provides the central additional functionality to Bootstrap to locate and enable the right modules.
pt_br: Este módulo fornece a funcionalidade adicional central para o Bootstrap localizar e ativar os módulos corretos.

source: NetBeans Platform Dev (Build {0})
pt_br: Plataforma NetBeans Des (Compilação {0})

source: netbeans.user is not set.
pt_br: netbeans.user não está definido.

source: Please check your NetBeans startup script.
pt_br: Por favor, verifique seu script de inicialização do NetBeans.

source: Your user directory may not be inside your NetBeans installation directory.
pt_br: Seu diretório de usuário não deve estar dentro do diretório de instalação do NetBeans.

source: Starting NetBeans Platform
pt_br: Inicializando a Plataforma NetBeans

source: Detail
pt_br: Detalhe

source: UI class name expected, using default UI...
pt_br: O nome da classe UI era esperado, utilizando UI padrão...

source: Directory expected after --userdir switch
pt_br: Era esperado um diretório após a chave --userdir

source: UI class not found, using default UI...
pt_br: Classe UI não encontrada, utilizando UI padrão...

source: Font size expected, using default font size...
pt_br: Era esperado o tamanho da fonte, utilizando tamanho padrão de fonte...

source: Bad format of the font size, using default font size...
pt_br: Tamanho da fonte em formato inválido, utilizando tamanho padrão de fonte...

source: Option --branding requires one argument
pt_br: A opção --branding precisa de um argumento

source: netbeans.home points to a non-existent directory.
pt_br: netbeans.home aponta para um diretório que não existe.

source: netbeans.home does not point to a directory.
pt_br: netbeans.home não aponta para um diretório.

source: netbeans.user points to a non-existent directory.
pt_br: netbeans.user aponta para um diretório que não existe.

source: netbeans.user does not point to a directory.
pt_br: netbeans.user não aponta para um diretório.

source: Cannot create system directory in {0}.
pt_br: Não foi possível criar o diretório de sistema em {0}.

source: A file with the same name already exists.
pt_br: Um arquivo com o mesmo nome já existe.

source: Cannot add System filesystem, exiting...
pt_br: Não foi possível adicionar o sistema de arquivos de sistema, saindo...

source: Initializing...
pt_br: Inicializando...

source: Could not connect to URL {0}.
pt_br: Não foi possível conectar com a URL {0}.

source: No such resource was found.
pt_br: O recurso não foi encontrado.

source: --fontsize is not supported on GTK look and feel.
pt_br: --fontsize não é suportado pela aparência e funcionalidade do GTK.

source: Adjust your desktop font size instead.
pt_br: Em vez disso, ajuste o tamanho da fonte de sua área de trabalho.

source: See the {0} for details.
pt_br: Veja {0} para detalhes.

source: The module {0} was requested in version >= {1} but only {2} was found.
pt_br: O módulo {0} foi requisitado na versão >= {1} mas apenas a {2} foi encontrada.

source: The module {0} would also need to be installed.
pt_br: O módulo {0} também deveria ser instalado.

source: [no version specified]
pt_br: [nenhuma versão especificada]

source: The module {0} was requested in implementation version "{1}" but only "{2}" was found.
pt_br: O módulo {0} foi requisitado na versão de implementação "{1}" mas apenas a "{2}" foi encontrada.

source: The module named {0} was needed and not found.
pt_br: O módulo nomeado {0} era necessário e não foi encontrado.

source: None of the modules providing the capability {0} could be installed.
pt_br: Nenhum dos módulos que fornecem a capacidade {0} puderam ser instalados.

source: No module providing the capability {0} could be found.
pt_br: Nenhum dos módulos que fornecem a capacidade {0} puderam ser encontrados.

source: The package containing the class {0} was not loaded.
pt_br: O pacote contendo a classe {0} não foi carregado.

source: The package {0} was not loaded or was an outdated version.
pt_br: O pacote {0} não foi carregado ou está em uma versão desatualizada.

source: The Java platform version {0} or higher was requested but only {1} is running.
pt_br: A versão da plataforma Java {0} ou superior é necessária mas apenas a versão {1} está rodando.

source: Information
pt_br: Informação

source: Disable and Continue
pt_br: Desabilitar e continuar

source: Exit
pt_br: Sair

source: {0,choice,1#Another module|1<{0} further modules} could not be installed due to the above problems.
pt_br: {0,choice,1#Outro módulo|1<{0} módulos posteriores} não puderam ser instalados de acordo com os seguines problemas.

source: Loading core...
pt_br: Carregando núcleo...

source: Loading core...done.
pt_br: Carregando núcleo... concluído.

source: Loading modules...
pt_br: Carregando módulos...

source: Done loading modules.
pt_br: Módulos carregados.

source: Turning on modules...
pt_br: Ativando módulos...

source: Turning on modules...done.
pt_br: Ativando módulos... concluído.

source: Turning on modules:
pt_br: Ativando módulos:

source: Turning off modules...
pt_br: Desativando módulos...

source: Turning off modules...done.
pt_br: Desativando módulos... concluído.

source: Turning off modules:
pt_br: Desativando módulos:

source: Warning - could not install some modules:
pt_br: Aviso - não foi possível instalar alguns módulos:

source: Warning - could not install module {0}
pt_br: Aviso - não foi possível instalar o módulo {0}

source: Reading module storage...
pt_br: Lendo armazenamento de módulos...

source: Reading module storage...done.
pt_br: Lendo armazenamento de módulos... concluído.

source: Starting modules...
pt_br: Inicializando módulos...

source: Installing {0}
pt_br: Instalando {0}

source: Installing new module: {0}
pt_br: Instalando novo módulo: {0}

source: Starting a new version of {0}
pt_br: Inicializando uma nova versão de {0}

source: Updating module: {0}
pt_br: Atualizando módulo: {0}

source: Stopping {0}
pt_br: Parando {0}

source: Loading installed objects...
pt_br: Carregando objetos instalados...

source: Warning: the module {0} could not be found, ignoring...
pt_br: Aviso: o módulo {0} não foi encontrado, ignorando...

source: The module {0} could not be deleted as it was an autoload or eager module and still in use.
pt_br: O módulo {0} não foi excluído por ser um módulo de carregamento automático ou eager e ainda está em uso.

source: An attempt was made to change the property {1} of the module {0} in the system/Modules folder.
pt_br: Foi realizada um tentativa de alterar a propriedade {1} do módulo {0} na pasta sistema/módulos.

source: The actual value is "{3}" but it was changed on disk to read "{2}".
pt_br: O valor atual é "{3}" mas não foi modificado no disco para ler "{2}".

source: This property cannot be changed while the IDE is running, so this attempt had no effect.
pt_br: Esta propriedade não pode ser alterada enquanto o IDE estiver em execução, então a tentativa não teve efeito.

source: Module patch or custom extension: {0}
pt_br: Módulo de correção ou extensão personalizada: {0}

source: Missing resource from class: {0}
pt_br: Faltando recursos da classe: {0}

source: Key which was not found: {0}
pt_br: Chave que não foi encontrada: {0}

source: Parse error in file {1} (PUBLIC {0})
pt_br: Erro na análise do arquivo {1} (PUBLIC {0})

source: Parse error in file {1} line {3} column {2} (PUBLIC {0})
pt_br: Erro na análise do arquivo {1} linha {3} coluna {2} (PUBLIC {0})

source: Default System
pt_br: Sistema padrão

source: Loading cached objects...
pt_br: Carregando objetos do cache...

source: Loading cached objects...done.
pt_br: Carregando objetos do cache...feito.

source: Recreating cache of objects...
pt_br: Recriando cache de objetos...

source: Recreating cache of objects...done.
pt_br: Recriando cache de objetos...feito.

source: Output {0}
pt_br: Saída {0}

source: {0} - I/O
pt_br: {0} - E/S

source: &Exit IDE
pt_br: &Sair do IDE

source: Exit IDE
pt_br: Sair do IDE

source: E&xiting the IDE will terminate the following processes:
pt_br: Sai&r do IDE irá terminar os seguintes processos:

source: Process - {0}
pt_br: Processo - {0}

source: {0} action in progress
pt_br: Ação {0} em progresso

source: Add Director&y...
pt_br: Ad&icionar diretório...

source: Add &JAR/ZIP...
pt_br: Adicionar &JAR/ZIP...

source: JAR and ZIP Archives
pt_br: Arquivos JAR e ZIP

source: Edit JAR File
pt_br: Editar arquivo JAR

source: Edit Local Directory
pt_br: Editar diretório local

source: Add JAR File
pt_br: Adicionar arquivo JAR

source: Add Local Directory
pt_br: Adicionar diretório local

source: &Process:
pt_br: &Processo:

source: &Arguments:
pt_br: &Argumentos:

source: Arguments &Hint
pt_br: &Dicas de argumentos

source: &Browse...
pt_br: &Procurar...

source: Core - Execution
pt_br: Núcleo - Execução

source: Implementation of the Execution engine.
pt_br: Implementação do mecanismo de execução.

source: Adds support for execution into the platform.
pt_br: Adicionar suporte para execução dentro da plataforma.

source: Contains classes which implement the execution part of APIs and corresponding GUI.
pt_br: Contém classes que implementam a parte de execução das APIs e a GUI correspondente.

source: Options Dialog and SPI
pt_br: SPI e caixa de diálogo de opções

source: Provides the Options dialog and an SPI to add panels to it.
pt_br: Fornece a caixa de diálogo de opções e uma SPI para adicionar painéis a ela.

source: Provides the Tools | Options dialog.
pt_br: Fornece a caixa de diálogo Ferramentas | Opções.
